; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	image3 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Planet3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 129)
	(supports instrument3 thermograph0)
	(supports instrument3 image3)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 168)
	(supports instrument5 image3)
	(supports instrument5 image1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet3)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 155)
	(= (data Planet3 thermograph0) 27)
	(= (data Star4 thermograph0) 91)
	(= (data Phenomenon5 thermograph0) 21)
	(= (data Star6 thermograph0) 25)
	(= (data Phenomenon7 thermograph0) 6)
	(= (data Planet8 thermograph0) 39)
	(= (data Star9 thermograph0) 54)
	(= (data Planet10 thermograph0) 260)
	(= (data Star11 thermograph0) 295)
	(= (data Planet3 thermograph2) 11)
	(= (data Star4 thermograph2) 197)
	(= (data Phenomenon5 thermograph2) 147)
	(= (data Star6 thermograph2) 241)
	(= (data Phenomenon7 thermograph2) 100)
	(= (data Planet8 thermograph2) 234)
	(= (data Star9 thermograph2) 99)
	(= (data Planet10 thermograph2) 19)
	(= (data Star11 thermograph2) 9)
	(= (data Planet3 image1) 172)
	(= (data Star4 image1) 234)
	(= (data Phenomenon5 image1) 176)
	(= (data Star6 image1) 77)
	(= (data Phenomenon7 image1) 288)
	(= (data Planet8 image1) 13)
	(= (data Star9 image1) 226)
	(= (data Planet10 image1) 102)
	(= (data Star11 image1) 36)
	(= (data Planet3 image3) 220)
	(= (data Star4 image3) 51)
	(= (data Phenomenon5 image3) 260)
	(= (data Star6 image3) 70)
	(= (data Phenomenon7 image3) 6)
	(= (data Planet8 image3) 149)
	(= (data Star9 image3) 42)
	(= (data Planet10 image3) 14)
	(= (data Star11 image3) 14)
	(= (slew_time GroundStation1 GroundStation0) 60.46)
	(= (slew_time GroundStation0 GroundStation1) 60.46)
	(= (slew_time GroundStation2 GroundStation0) 18.1)
	(= (slew_time GroundStation0 GroundStation2) 18.1)
	(= (slew_time GroundStation2 GroundStation1) 2.264)
	(= (slew_time GroundStation1 GroundStation2) 2.264)
	(= (slew_time Planet3 GroundStation0) 53.62)
	(= (slew_time GroundStation0 Planet3) 53.62)
	(= (slew_time Planet3 GroundStation1) 7.804)
	(= (slew_time GroundStation1 Planet3) 7.804)
	(= (slew_time Planet3 GroundStation2) 3.901)
	(= (slew_time GroundStation2 Planet3) 3.901)
	(= (slew_time Star4 GroundStation0) 51.69)
	(= (slew_time GroundStation0 Star4) 51.69)
	(= (slew_time Star4 GroundStation1) 19.51)
	(= (slew_time GroundStation1 Star4) 19.51)
	(= (slew_time Star4 GroundStation2) 61.33)
	(= (slew_time GroundStation2 Star4) 61.33)
	(= (slew_time Star4 Planet3) 10.03)
	(= (slew_time Planet3 Star4) 10.03)
	(= (slew_time Phenomenon5 GroundStation0) 27.84)
	(= (slew_time GroundStation0 Phenomenon5) 27.84)
	(= (slew_time Phenomenon5 GroundStation1) 5.101)
	(= (slew_time GroundStation1 Phenomenon5) 5.101)
	(= (slew_time Phenomenon5 GroundStation2) 7.914)
	(= (slew_time GroundStation2 Phenomenon5) 7.914)
	(= (slew_time Phenomenon5 Planet3) 75.43)
	(= (slew_time Planet3 Phenomenon5) 75.43)
	(= (slew_time Phenomenon5 Star4) 34.38)
	(= (slew_time Star4 Phenomenon5) 34.38)
	(= (slew_time Star6 GroundStation0) 19.72)
	(= (slew_time GroundStation0 Star6) 19.72)
	(= (slew_time Star6 GroundStation1) 46.49)
	(= (slew_time GroundStation1 Star6) 46.49)
	(= (slew_time Star6 GroundStation2) 36.82)
	(= (slew_time GroundStation2 Star6) 36.82)
	(= (slew_time Star6 Planet3) 60.81)
	(= (slew_time Planet3 Star6) 60.81)
	(= (slew_time Star6 Star4) 1.861)
	(= (slew_time Star4 Star6) 1.861)
	(= (slew_time Star6 Phenomenon5) 80.71)
	(= (slew_time Phenomenon5 Star6) 80.71)
	(= (slew_time Phenomenon7 GroundStation0) 10.73)
	(= (slew_time GroundStation0 Phenomenon7) 10.73)
	(= (slew_time Phenomenon7 GroundStation1) 15.45)
	(= (slew_time GroundStation1 Phenomenon7) 15.45)
	(= (slew_time Phenomenon7 GroundStation2) 59.77)
	(= (slew_time GroundStation2 Phenomenon7) 59.77)
	(= (slew_time Phenomenon7 Planet3) 24.13)
	(= (slew_time Planet3 Phenomenon7) 24.13)
	(= (slew_time Phenomenon7 Star4) 13.22)
	(= (slew_time Star4 Phenomenon7) 13.22)
	(= (slew_time Phenomenon7 Phenomenon5) 43.49)
	(= (slew_time Phenomenon5 Phenomenon7) 43.49)
	(= (slew_time Phenomenon7 Star6) 38.22)
	(= (slew_time Star6 Phenomenon7) 38.22)
	(= (slew_time Planet8 GroundStation0) 13.33)
	(= (slew_time GroundStation0 Planet8) 13.33)
	(= (slew_time Planet8 GroundStation1) 27.84)
	(= (slew_time GroundStation1 Planet8) 27.84)
	(= (slew_time Planet8 GroundStation2) 46.83)
	(= (slew_time GroundStation2 Planet8) 46.83)
	(= (slew_time Planet8 Planet3) 11.71)
	(= (slew_time Planet3 Planet8) 11.71)
	(= (slew_time Planet8 Star4) 62.29)
	(= (slew_time Star4 Planet8) 62.29)
	(= (slew_time Planet8 Phenomenon5) 66.91)
	(= (slew_time Phenomenon5 Planet8) 66.91)
	(= (slew_time Planet8 Star6) 49.39)
	(= (slew_time Star6 Planet8) 49.39)
	(= (slew_time Planet8 Phenomenon7) 54.7)
	(= (slew_time Phenomenon7 Planet8) 54.7)
	(= (slew_time Star9 GroundStation0) 25)
	(= (slew_time GroundStation0 Star9) 25)
	(= (slew_time Star9 GroundStation1) 15.92)
	(= (slew_time GroundStation1 Star9) 15.92)
	(= (slew_time Star9 GroundStation2) 51.87)
	(= (slew_time GroundStation2 Star9) 51.87)
	(= (slew_time Star9 Planet3) 55.76)
	(= (slew_time Planet3 Star9) 55.76)
	(= (slew_time Star9 Star4) 10.27)
	(= (slew_time Star4 Star9) 10.27)
	(= (slew_time Star9 Phenomenon5) 68.32)
	(= (slew_time Phenomenon5 Star9) 68.32)
	(= (slew_time Star9 Star6) 17.14)
	(= (slew_time Star6 Star9) 17.14)
	(= (slew_time Star9 Phenomenon7) 26.24)
	(= (slew_time Phenomenon7 Star9) 26.24)
	(= (slew_time Star9 Planet8) 65.83)
	(= (slew_time Planet8 Star9) 65.83)
	(= (slew_time Planet10 GroundStation0) 39.46)
	(= (slew_time GroundStation0 Planet10) 39.46)
	(= (slew_time Planet10 GroundStation1) 66.05)
	(= (slew_time GroundStation1 Planet10) 66.05)
	(= (slew_time Planet10 GroundStation2) 93.52)
	(= (slew_time GroundStation2 Planet10) 93.52)
	(= (slew_time Planet10 Planet3) 21.77)
	(= (slew_time Planet3 Planet10) 21.77)
	(= (slew_time Planet10 Star4) 10.3)
	(= (slew_time Star4 Planet10) 10.3)
	(= (slew_time Planet10 Phenomenon5) 6.953)
	(= (slew_time Phenomenon5 Planet10) 6.953)
	(= (slew_time Planet10 Star6) 4.697)
	(= (slew_time Star6 Planet10) 4.697)
	(= (slew_time Planet10 Phenomenon7) 26.62)
	(= (slew_time Phenomenon7 Planet10) 26.62)
	(= (slew_time Planet10 Planet8) 33.24)
	(= (slew_time Planet8 Planet10) 33.24)
	(= (slew_time Planet10 Star9) 29.62)
	(= (slew_time Star9 Planet10) 29.62)
	(= (slew_time Star11 GroundStation0) 30.36)
	(= (slew_time GroundStation0 Star11) 30.36)
	(= (slew_time Star11 GroundStation1) 3.107)
	(= (slew_time GroundStation1 Star11) 3.107)
	(= (slew_time Star11 GroundStation2) 48.56)
	(= (slew_time GroundStation2 Star11) 48.56)
	(= (slew_time Star11 Planet3) 19.18)
	(= (slew_time Planet3 Star11) 19.18)
	(= (slew_time Star11 Star4) 3.984)
	(= (slew_time Star4 Star11) 3.984)
	(= (slew_time Star11 Phenomenon5) 19.68)
	(= (slew_time Phenomenon5 Star11) 19.68)
	(= (slew_time Star11 Star6) 27.51)
	(= (slew_time Star6 Star11) 27.51)
	(= (slew_time Star11 Phenomenon7) 31.17)
	(= (slew_time Phenomenon7 Star11) 31.17)
	(= (slew_time Star11 Planet8) 16.05)
	(= (slew_time Planet8 Star11) 16.05)
	(= (slew_time Star11 Star9) 50.2)
	(= (slew_time Star9 Star11) 50.2)
	(= (slew_time Star11 Planet10) 60.79)
	(= (slew_time Planet10 Star11) 60.79)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Planet3 thermograph2)
	(have_image Star4 thermograph2)
	(have_image Phenomenon5 image3)
	(have_image Star6 thermograph2)
	(have_image Phenomenon7 thermograph0)
	(have_image Planet8 image3)
	(have_image Star11 image3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 129 to 110.9, (fuel-used) from 0 to 18.1
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 8
5. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
6. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 8
7. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 110.9 to 108.636, (fuel-used) from 18.1 to 20.364
   goals met: 0 of 8
8. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 108.636 to 105.529, (fuel-used) from 20.364 to 23.471
   goals met: 0 of 8
9. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 105.529 to 102.422, (fuel-used) from 23.471 to 26.578
   goals met: 0 of 8
10. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 102.422 to 99.315, (fuel-used) from 26.578 to 29.685
   goals met: 0 of 8
11. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 99.315 to 96.208, (fuel-used) from 29.685 to 32.792
   goals met: 0 of 8
12. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 96.208 to 93.101, (fuel-used) from 32.792 to 35.899
   goals met: 0 of 8
13. (take_image satellite0 star11 instrument1 image3)
   added: (have_image star11 image3)
   changed: (data_capacity satellite0) from 1000 to 986, (data-stored) from 0 to 14
   goals met: 1 of 8
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 8
15. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 8
17. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 93.101 to 89.994, (fuel-used) from 35.899 to 39.006
   goals met: 1 of 8
18. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 89.994 to 86.887, (fuel-used) from 39.006 to 42.113
   goals met: 1 of 8
19. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 86.887 to 83.78, (fuel-used) from 42.113 to 45.22
   goals met: 1 of 8
20. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 83.78 to 80.673, (fuel-used) from 45.22 to 48.327
   goals met: 1 of 8
21. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 80.673 to 77.566, (fuel-used) from 48.327 to 51.434
   goals met: 1 of 8
22. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
23. (turn_to satellite0 groundstation2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 77.566 to 75.302, (fuel-used) from 51.434 to 53.698
   goals met: 1 of 8
24. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 8
25. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 8
26. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 75.302 to 73.038, (fuel-used) from 53.698 to 55.962
   goals met: 1 of 8
27. (turn_to satellite0 planet3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 73.038 to 65.234, (fuel-used) from 55.962 to 63.766
   goals met: 1 of 8
28. (turn_to satellite0 groundstation1 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 65.234 to 57.43, (fuel-used) from 63.766 to 71.57
   goals met: 1 of 8
29. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
30. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 57.43 to 54.323, (fuel-used) from 71.57 to 74.677
   goals met: 1 of 8
31. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 54.323 to 51.216, (fuel-used) from 74.677 to 77.784
   goals met: 1 of 8
32. (turn_to satellite0 groundstation2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 51.216 to 48.952, (fuel-used) from 77.784 to 80.048
   goals met: 1 of 8
33. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 8
34. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
35. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
36. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 48.952 to 46.688, (fuel-used) from 80.048 to 82.312
   goals met: 1 of 8
37. (turn_to satellite0 planet3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 46.688 to 38.884, (fuel-used) from 82.312 to 90.116
   goals met: 1 of 8
38. (turn_to satellite0 groundstation2 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 38.884 to 34.983, (fuel-used) from 90.116 to 94.017
   goals met: 1 of 8
39. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 8
40. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
41. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 8
42. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 8
43. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
44. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
45. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 34.983 to 32.719, (fuel-used) from 94.017 to 96.281
   goals met: 1 of 8
46. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 32.719 to 29.612, (fuel-used) from 96.281 to 99.388
   goals met: 1 of 8
47. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 29.612 to 26.505, (fuel-used) from 99.388 to 102.495
   goals met: 1 of 8
48. (turn_to satellite0 groundstation2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 26.505 to 24.241, (fuel-used) from 102.495 to 104.759
   goals met: 1 of 8
49. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 8
50. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
51. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 8
52. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
53. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
54. (turn_to satellite0 planet3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 24.241 to 20.34, (fuel-used) from 104.759 to 108.66
   goals met: 1 of 8
55. (take_image satellite0 planet3 instrument0 thermograph2)
   added: (have_image planet3 thermograph2)
   changed: (data_capacity satellite0) from 986 to 975, (data-stored) from 14 to 25
   goals met: 2 of 8
56. (turn_to satellite0 groundstation2 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 20.34 to 16.439, (fuel-used) from 108.66 to 112.561
   goals met: 2 of 8
57. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 8
58. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 8
59. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 8
60. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 16.439 to 14.175, (fuel-used) from 112.561 to 114.825
   goals met: 2 of 8
61. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 8
62. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 8
63. (turn_to satellite1 planet3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 168 to 156.29, (fuel-used) from 114.825 to 126.535
   goals met: 2 of 8
64. (turn_to satellite1 planet8 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 156.29 to 144.58, (fuel-used) from 126.535 to 138.245
   goals met: 2 of 8
65. (turn_to satellite1 planet3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 144.58 to 132.87, (fuel-used) from 138.245 to 149.955
   goals met: 2 of 8
66. (turn_to satellite1 planet8 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 132.87 to 121.16, (fuel-used) from 149.955 to 161.665
   goals met: 2 of 8
67. (turn_to satellite1 planet3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 121.16 to 109.45, (fuel-used) from 161.665 to 173.375
   goals met: 2 of 8
68. (turn_to satellite1 planet8 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 109.45 to 97.74, (fuel-used) from 173.375 to 185.085
   goals met: 2 of 8
69. (turn_to satellite1 planet3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 97.74 to 86.03, (fuel-used) from 185.085 to 196.795
   goals met: 2 of 8
70. (turn_to satellite1 groundstation2 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 86.03 to 82.129, (fuel-used) from 196.795 to 200.696
   goals met: 2 of 8
71. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 14.175 to 11.068, (fuel-used) from 200.696 to 203.803
   goals met: 2 of 8
72. (turn_to satellite0 star4 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 11.068 to 7.084, (fuel-used) from 203.803 to 207.787
   goals met: 2 of 8
73. (turn_to satellite1 groundstation1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 82.129 to 79.865, (fuel-used) from 207.787 to 210.051
   goals met: 2 of 8
74. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 2 of 8
75. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 79.865 to 52.025, (fuel-used) from 210.051 to 237.891
   goals met: 2 of 8
76. (take_image satellite1 planet8 instrument3 image3)
   added: (have_image planet8 image3)
   changed: (data_capacity satellite1) from 1000 to 851, (data-stored) from 25 to 174
   goals met: 3 of 8
77. (turn_to satellite1 groundstation0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 52.025 to 38.695, (fuel-used) from 237.891 to 251.221
   goals met: 3 of 8
78. (turn_to satellite1 phenomenon7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon7)
   changed: (fuel satellite1) from 38.695 to 27.965, (fuel-used) from 251.221 to 261.951
   goals met: 3 of 8
79. (take_image satellite1 phenomenon7 instrument3 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   changed: (data_capacity satellite1) from 851 to 845, (data-stored) from 174 to 180
   goals met: 4 of 8
80. (turn_to satellite0 star6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 7.084 to 5.223, (fuel-used) from 261.951 to 263.812
   goals met: 5 of 8
81. (turn_to satellite0 star4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 5.223 to 3.362, (fuel-used) from 263.812 to 265.673
   goals met: 4 of 8
82. (turn_to satellite1 groundstation1 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 27.965 to 12.515, (fuel-used) from 265.673 to 281.123
   goals met: 4 of 8
83. (turn_to satellite1 phenomenon5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 12.515 to 7.414, (fuel-used) from 281.123 to 286.224
   goals met: 4 of 8
84. (turn_to satellite0 star6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 3.362 to 1.501, (fuel-used) from 286.224 to 288.085
   goals met: 5 of 8
85. (turn_to satellite2 groundstation0 planet3)
   deleted: (pointing satellite2 planet3)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 155 to 101.38, (fuel-used) from 288.085 to 341.705
   goals met: 5 of 8
86. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 5 of 8
87. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 5 of 8
88. (turn_to satellite2 star4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 101.38 to 49.69, (fuel-used) from 341.705 to 393.395
   goals met: 5 of 8
89. (take_image satellite2 star4 instrument5 thermograph2)
   added: (have_image star4 thermograph2)
   changed: (data_capacity satellite2) from 1000 to 803, (data-stored) from 180 to 377
   goals met: 6 of 8
90. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 8
91. (turn_to satellite2 star6 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star6)
   changed: (fuel satellite2) from 49.69 to 47.829, (fuel-used) from 393.395 to 395.256
   goals met: 6 of 8
92. (take_image satellite1 phenomenon5 instrument3 image3)
   added: (have_image phenomenon5 image3)
   changed: (data_capacity satellite1) from 845 to 585, (data-stored) from 377 to 637
   goals met: 7 of 8
93. (take_image satellite2 star6 instrument5 thermograph2)
   added: (have_image star6 thermograph2)
   changed: (data_capacity satellite2) from 803 to 562, (data-stored) from 637 to 878
   goals met: 8 of 8
